var all_scores = {'杨璐':[131,143,144],
        '王雪':[131,135,144],
        '韩林霖':[127,139,142],
        '沙龙逸':[123,148,136],
        '李鉴学':[126,135,140],
        '韩雨萌':[129,133,138],
        '刘帅':[116,143,140],
        '康惠雯':[114,142,139],
        '刘钰婷':[115,139,135],
        '林世博':[116,142,129]};
//存储所有学生的姓名
var stu_names = ['杨璐','王雪','韩林霖','沙龙逸','李鉴学','韩雨萌','刘帅','康惠雯','刘钰婷','林世博'];
var scores_A_count = 0;//统计出所有分数中>140分的个数
var scores_B_count = 0;//统计介于130到140之间的成绩（包括130和140）的个数
var scores_C_count = 0;//统计<130的成绩的个数
//完成代码使得正确统计各分数段的分数个数

//打印个分数段的分数
console.log(scores_A_count);
console.log(scores_B_count);
console.log(scores_C_count);